app/controllers/fridges_controller.rb

SELECT "fridges".* FROM "fridges"
---
    def index
        fridges = Fridge.all

INSERT INTO "fridges" ("username", "password") VALUES ($1, $2) RETURNING "id"  [["username", "Sean"], ["password", "password"]]
---
    def create
        fridge = Fridge.create(fridge_params)

SELECT "fridges".* FROM "fridges" WHERE "fridges"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      fridge = Fridge.find(params[:id])