app/controllers/fridge_ingredients_controller.rb

    def index
        fridge_ingredients = FridgeIngredient.all
---
SELECT "fridge_ingredients".* FROM "fridge_ingredients"

    def create
        fridge_ingredient = FridgeIngredient.create(fridge_ingredient_params)
---
INSERT INTO "fridge_ingredients" ("fridge_id", "ingredient_id") VALUES ($1, $2) RETURNING "id"  [["fridge_id", 10], ["ingredient_id", 4]]

    def show
      fridge_ingredient = FridgeIngredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def destroy
      fridge_ingredient = FridgeIngredient.find(params[:id])
      fridge_ingredient.destroy
---
SELECT "fridge_ingredients".* FROM "fridge_ingredients" WHERE "fridge_ingredients"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
DELETE FROM "fridge_ingredients" WHERE "fridge_ingredients"."id" = $1  [["id", 34]]