app/controllers/recipes_controller.rb

    def index
        recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

    def show
        recipe = Recipe.find(params[:id])
        ingredients = recipe.recipe_ingredients.map{|r| r.ingredient}
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]