app/models/Fridge.rb

    def recipes
      truth_array = []
      recipe_array = []
      fridge_ingredients = self.ingredients.map do |ingredient|
        ingredient
      end
      Recipe.all.each do |recipe|
        recipe.ingredients.each do |ingredient|
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "fridge_ingredients" ON "ingredients"."id" = "fridge_ingredients"."ingredient_id" WHERE "fridge_ingredients"."fridge_id" = $1  [["fridge_id", 1]]
SELECT "recipes".* FROM "recipes"
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]